"//button[text() = 'Войти в аккаунт']"                            # кнопка войти в аккаунт
'//p[text() ="Личный Кабинет"]'                                   # кнопка личный кабинет
'//p[text()="Конструктор"]'                                       # кнопка конструктор
"//span[text()='Соусы']"                                          # переход в раздел соусы
"//span[text()='Начинки']"                                        # переход в раздел начинки
"//span[text()='Булки']"                                          # переход в раздел булки
'//div[contains(@class, "AppHeader")]'                            # кнопка Stellar Burgers
"//label[contains(text(), 'Имя')]/following-sibling::input"       # поле ввода имени при регистрации
"//label[contains(text(), 'Email')]/following-sibling::input"     # поле ввода email при регистрации
"//label[contains(text(), 'Пароль')]/following-sibling::input"    # поле ввода пароля при регистрации
'//button[text() = "Зарегистрироваться"]'                         # кнопка зарегестрироваться
'//p[text()="Некорректный пароль"]'                               # всплывающая надпись "некорректный пароль"
'//a[text()="Войти"]'                                             # кнопка войти в окне регистрации
'name'                                                            # поле ввода email при авторизации
'Пароль'                                                          # поле ввода пароля при авторизации
'//button[text() ="Войти"]'                                       # кнопка войти в поле авторизации
"//a[text() = 'Зарегистрироваться']"                              # кнопка зарегестрироваться в поле авторизации
'//a[text()="Восстановить пароль"]'                               # кнопка восстановить пароль в поле авторизации
'//button[text()="Выход"]'                                        # кнопка выход в окне личного кабинета
